import numpy as np

# 1.基于提供的数据创建数组对象  ndarray  n维数组
# 维度: 轴的数量
# arr1 = np.array((1, 2, 3, 4))  # 一维数组
arr1 = np.array([1, 2, 3, 4])  # 一维数组
# arr1 = np.array([[1, 2, 3, 4],
#                  [5, 6, 7, 8]])  # 二维数据
# arr1 = np.array([[[1, 2, 3, 4],
#                   [5, 6, 7, 8]],
#                  [[2, 3, 4, 5],
#                   [4, 5, 6, 7]]])  # 三维数据
print(type(arr1))
"""
[[[1 2 3 4]
  [5 6 7 8]]

 [[2 3 4 5]
  [4 5 6 7]]]

有几组中括号就是几维, 当前三组中括号, 就是3维数组
一个3维数据集有2个维数据, 每个2维数据中有2个一维数据, 每个1维数据中4个值(0维/标量)
"""
print(arr1)

print('=' * 80)
# 2.创建全0数组, 全1数组
# (2, 3) -> 0轴有2个数据, 1轴有3个数据 -> 2行3列
# (2, 3) -> 降一维读, 2维数据集中有2个一维, 每个1维中有3个值
# arr2 = np.zeros((2, 3))
# (2, 3, 4) -> 数组形状, 元组中有多少个元素, 就表示数据集是几维(有几个轴)
# (2, 3, 4) -> 0轴有2个数据, 1轴有3个数据, 2轴有4个数据
# (2, 3, 4) -> 降一维读, 3维数据集中有2个二维, 每个2维中有3个一维, 每个1维中有4个值
arr2 = np.zeros((2, 3, 4))
print(arr2)

arr3 = np.ones((3, 2, 4, 6, 5)) # 5维 -> 3个四维度 --> 2个三维 -->4个二维 --> 6个一维 --> 5个值
print(arr3)


# 正态分布
arr4 = np.random.randn(3,9)
print('arr4-->',arr4)

# 均匀分布
arr5 = np.random.rand(2 ,5, 2)
print('arr5-->',arr5)


arr6 = np.arange(20)
print(arr6)

arr7 = arr6.reshape(4,5)
print(arr7)












